@echo off

rem ----------------------------------------------------------------------------------------
rem 健康情報一括登録バッチ
rem 指定したディレクトリのJSONファイルから健康情報を登録する
rem ----------------------------------------------------------------------------------------

echo ------------------------------------------------------------------------
echo START %~n0%~x0
echo ------------------------------------------------------------------------

rem 共通シェルの読込
call common.bat

cd %BASE_DIR%\ha-batch\target
java -jar -Dspring.profiles.active=%ENV% -Dspring.batch.job.names=healthInfoFileRegistBatchJob %JAR_FILE%

echo ------------------------------------------------------------------------
echo END %~n0%~x0
echo ------------------------------------------------------------------------

cd %~dp0
