#!/bin/sh

# ----------------------------------------------------------------------------------------
# AWS SQS取込バッチ
# 
# 概要：SQSからメッセージを取得し、以下のテーブルに登録する。
#      ・API_COMMUNICATION_DATA
# 
# 引数：なし
# 
# input: SQS-AWS
# 
# output: MySQL-API_COMMUNICATION_DATA
# ----------------------------------------------------------------------------------------

echo "------------------------------------------------------------------------"
echo "START $0"
echo "------------------------------------------------------------------------"

# call common.sh
. ./common.sh

cd ${BASE_DIR} && docker compose -f docker-compose.yml -f docker-compose.${ENV}.yml run --rm ha-batch --spring.batch.job.name=awsSqsImportBatchJob

echo "------------------------------------------------------------------------"
echo "END $0"
echo "------------------------------------------------------------------------"
