#!/bin/sh

# ----------------------------------------------------------------------------------------
# 健康情報一括登録バッチ
# 
# 概要：指定したディレクトリのJSONファイルから健康情報を登録する。
# 
# 引数：なし
# 
# input: /home/admin/data/healthInfoRegist/*json
# 
# output: MySQL.HEALTH_INFO
# ----------------------------------------------------------------------------------------

echo "------------------------------------------------------------------------"
echo "START $0"
echo "------------------------------------------------------------------------"

# call common.sh
. ./common.sh

cd ${BASE_DIR} && docker compose -f docker-compose.yml -f docker-compose.${ENV}.yml run --rm ha-batch --spring.batch.job.name=healthInfoFileRegistBatchJob

echo "------------------------------------------------------------------------"
echo "END $0"
echo "------------------------------------------------------------------------"
