#!/bin/sh

########################################
# mvn-compileを行うshell
########################################

# 基底ディレクトリ
BASE_DIR="/Applications/Eclipse_4.8.0.app/Contents/workspace/work-3g"

# プロジェクトディレクトリ
COMMON_DIR=${BASE_DIR}"/ha-common"
DB_DIR=${BASE_DIR}"/ha-db"
WEB_DIR=${BASE_DIR}"/ha-web"
BUSINESS_DIR=${BASE_DIR}"/ha-business"


echo "-----------------------"
echo "START maven-compile.sh"
echo "-----------------------"

echo "------------------------------------------------------------------------"
echo "START common project compile"
echo "------------------------------------------------------------------------"
cd ${COMMON_DIR}
mvn compile
echo "------------------------------------------------------------------------"
echo "END common project compile"
echo "------------------------------------------------------------------------"


echo "------------------------------------------------------------------------"
echo "START db project compile"
echo "------------------------------------------------------------------------"
cd ${DB_DIR}
mvn compile
echo "------------------------------------------------------------------------"
echo "END db project compile"
echo "------------------------------------------------------------------------"

echo "------------------------------------------------------------------------"
echo "START web project compile"
echo "------------------------------------------------------------------------"
cd ${WEB_DIR}
mvn compile
echo "------------------------------------------------------------------------"
echo "END web project compile"
echo "------------------------------------------------------------------------"


echo "------------------------------------------------------------------------"
echo "START business project compile"
echo "------------------------------------------------------------------------"
cd ${BUSINESS_DIR}
mvn compile
echo "------------------------------------------------------------------------"
echo "END business project compile"
echo "------------------------------------------------------------------------"


# 元のshellのディレクトリに戻る
cd ${BASE_DIR}"/ha-build/shell"

echo "---------------------"
echo "END maven-compile.sh"
echo "---------------------"
