#!/bin/sh

########################################
# mvn-compileを行うshell
########################################

# 基底ディレクトリ
baseDir="/Applications/Eclipse_4.8.0.app/Contents/workspace/work-3g"

# プロジェクトディレクトリ
commonDir=${baseDir}"/ha-common"
dbDir=${baseDir}"/ha-db"
webDir=${baseDir}"/ha-web"
businessDir=${baseDir}"/ha-business"


echo "-----------------------"
echo "START maven-compile.sh"
echo "-----------------------"

echo "------------------------------------------------------------------------"
echo "START common project compile"
echo "------------------------------------------------------------------------"
cd ${commonDir}
mvn compile
echo "------------------------------------------------------------------------"
echo "END common project compile"
echo "------------------------------------------------------------------------"


echo "------------------------------------------------------------------------"
echo "START db project compile"
echo "------------------------------------------------------------------------"
cd ${dbDir}
mvn compile
echo "------------------------------------------------------------------------"
echo "END db project compile"
echo "------------------------------------------------------------------------"

echo "------------------------------------------------------------------------"
echo "START web project compile"
echo "------------------------------------------------------------------------"
cd ${webDir}
mvn compile
echo "------------------------------------------------------------------------"
echo "END web project compile"
echo "------------------------------------------------------------------------"


echo "------------------------------------------------------------------------"
echo "START business project compile"
echo "------------------------------------------------------------------------"
cd ${businessDir}
mvn compile
echo "------------------------------------------------------------------------"
echo "END business project compile"
echo "------------------------------------------------------------------------"


# 元のshellのディレクトリに戻る
cd ${baseDir}"/ha-build/shell"

echo "---------------------"
echo "END maven-compile.sh"
echo "---------------------"
