@echo off

rem ------------------------------------------------------------------------
rem
rem NodeAPIのモジュールのインストールを行う
rem node_modulesとpackage-lock.jsonを作成
rem
rem ------------------------------------------------------------------------

cls

echo ------------------------------------------------------------------------
echo start npm install
echo ------------------------------------------------------------------------

rem ha-nodeまで移動
cd ../../ha-node

rem nodeモジュールをインストール
npm install

cd %~dp0
