@echo off

rem ------------------------------------------------------------------------
rem
rem Nodeのモジュールの更新を行う
rem package.jsonのdependencies内のversionの最新化
rem
rem ------------------------------------------------------------------------

cls

echo ------------------------------------------------------------------------
echo start npm update
echo ------------------------------------------------------------------------

rem ha-root/frontまで移動
cd ../../ha-root/front

rem nodeモジュールをアップデート
npm update

cd %~dp0
